<a href="https://colab.research.google.com/github/nurindahfidiawati/Datamining/blob/master/Datamining_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Praktikum 7

In [ ]:
#blok 1
import pandas as pd
df = pd.read_csv("/content/m08 12-18apr p dataset titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [ ]:
#blok 2
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [ ]:
#blok 3
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [ ]:
#blok 4
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [ ]:
#blok 5
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [ ]:
#blok 6
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [ ]:
#blok 7
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [ ]:
#blok 8
inputs.Age[:20]

0     22.0
1     38.0
2     26.0
3     35.0
4     35.0
5      NaN
6     54.0
7      2.0
8     27.0
9     14.0
10     4.0
11    58.0
12    20.0
13    39.0
14    14.0
15    55.0
16     2.0
17     NaN
18    31.0
19     NaN
Name: Age, dtype: float64

In [ ]:
#blok 9
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [ ]:
#blok 10
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [ ]:
#blok 11
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.7873134328358209

In [ ]:
#blok 12
X_test[0:10]

     Pclass        Age      Fare  female
531       3  29.699118    7.2292       0
2         3  26.000000    7.9250       1
393       1  23.000000  113.2750       1
587       1  60.000000   79.2000       0
143       3  19.000000    6.7500       0
600       2  24.000000   27.0000       1
647       1  56.000000   35.5000       0
357       2  38.000000   13.0000       1
95        3  29.699118    8.0500       0
444       3  29.699118    8.1125       0

In [ ]:
#blok 13
y_test[0:10]

531    0
2      1
393    1
587    1
143    0
600    1
647    1
357    0
95     0
444    1
Name: Survived, dtype: int64

In [ ]:
#blok 14
model.predict(X_test[0:10])

array([0, 1, 1, 1, 0, 1, 0, 1, 0, 0])

In [ ]:
#blok 15
model.predict_proba(X_test[:10])

array([[0.96665625, 0.03334375],
       [0.46316772, 0.53683228],
       [0.00304608, 0.99695392],
       [0.43673177, 0.56326823],
       [0.9601181 , 0.0398819 ],
       [0.29184333, 0.70815667],
       [0.78023637, 0.21976363],
       [0.32903877, 0.67096123],
       [0.96683381, 0.03316619],
       [0.96684659, 0.03315341]])

#Tugas

In [ ]:
import pandas as pd
from sklearn.naive_bayes import GaussianNB
from sklearn.model_selection import train_test_split
from sklearn.datasets import load_iris

##Data Adult

In [ ]:
columns = ['age', 
           'workclass', 
           'fnlwgt', 
           'education', 
           'education-num', 
           'marital-status', 
           'occupation', 
           'relationship', 
           'race', 
           'sex', 
           'capital-gain', 
           'capital-loss', 
           'hours-per-week', 
           'native-country', 
           'label']
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data", names=columns)
df.head()

   age          workclass  fnlwgt  ... hours-per-week  native-country   label
0   39          State-gov   77516  ...             40   United-States   <=50K
1   50   Self-emp-not-inc   83311  ...             13   United-States   <=50K
2   38            Private  215646  ...             40   United-States   <=50K
3   53            Private  234721  ...             40   United-States   <=50K
4   28            Private  338409  ...             40            Cuba   <=50K

[5 rows x 15 columns]

In [ ]:
inputs = df.drop(['label', 'workclass', 'occupation', 'native-country', 'fnlwgt'],axis='columns')
target = pd.get_dummies(df.label)
target = target[" <=50K"]

In [ ]:
#cek data null
df[df['native-country'] == " ?"].count()

age               583
workclass         583
fnlwgt            583
education         583
education-num     583
marital-status    583
occupation        583
relationship      583
race              583
sex               583
capital-gain      583
capital-loss      583
hours-per-week    583
native-country    583
label             583
dtype: int64

In [ ]:
education = pd.get_dummies(inputs['education'])
marital_status = pd.get_dummies(inputs['marital-status'])
relationship = pd.get_dummies(inputs['relationship'])
race = pd.get_dummies(inputs['race'])
sex = pd.get_dummies(inputs['sex'])

In [ ]:
inputs = pd.concat([inputs, education, marital_status, relationship, race, sex], axis='columns')
inputs = inputs.drop(['education', 'marital-status', 'relationship', 'race', 'sex', ' Male'], axis='columns')
inputs.head()

   age  education-num  capital-gain  ...   Other   White   Female
0   39             13          2174  ...       0       1        0
1   50             13             0  ...       0       1        0
2   38              9             0  ...       0       1        0
3   53              7             0  ...       0       0        0
4   28             13             0  ...       0       0        1

[5 rows x 40 columns]

##Data Iris

In [ ]:
iris = load_iris()
inputs = pd.DataFrame(iris.data, columns=iris.feature_names)
target = pd.Series(iris.target, name='target')
df = pd.concat([inputs, target], axis='columns')
df.head()

   sepal length (cm)  sepal width (cm)  ...  petal width (cm)  target
0                5.1               3.5  ...               0.2       0
1                4.9               3.0  ...               0.2       0
2                4.7               3.2  ...               0.2       0
3                4.6               3.1  ...               0.2       0
4                5.0               3.6  ...               0.2       0

[5 rows x 5 columns]

##Model

###Test 0.2

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2, random_state=42)

###Test 0.3

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3, random_state=42)

###Test 0.4

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.4, random_state=42)

###Pelatihan dan prediksi

In [ ]:
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.9777777777777777

In [ ]:
X_test[:1]

    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
73                6.1               2.8                4.7               1.2

In [ ]:
coba = pd.DataFrame([[6.1, 2.8, 4.7, 1.2]], columns=iris.feature_names)
model.predict([[6.1, 2.8, 4.7, 1.2]])

array([1])

In [ ]:
X_test[:10]

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
73                 6.1               2.8                4.7               1.2
18                 5.7               3.8                1.7               0.3
118                7.7               2.6                6.9               2.3
78                 6.0               2.9                4.5               1.5
76                 6.8               2.8                4.8               1.4
31                 5.4               3.4                1.5               0.4
64                 5.6               2.9                3.6               1.3
141                6.9               3.1                5.1               2.3
68                 6.2               2.2                4.5               1.5
82                 5.8               2.7                3.9               1.2

In [ ]:
model.predict(X_test[:10])

array([1, 0, 2, 1, 1, 0, 1, 2, 1, 1])